In [5]:
import pandas as pd
import sqlite3
import json

In [7]:
orders_df=pd.read_csv("C://Users//HP//Downloads//orders.csv")

In [9]:
with open("C://Users//HP//Downloads//users.json",'r') as f:
    users_data=json.load(f)
users = pd.DataFrame(users_data)

In [11]:
conn=sqlite3.connect(':memory:')
with open("C://Users//HP//Downloads//restaurants.sql",'r') as f:
    conn.executescript(f.read())
restaurants=pd.read_sql_query("SELECT * FROM restaurants",conn)

In [13]:
merged_data=pd.merge(orders_df,users,on='user_id',how='left')

In [15]:
final_df=pd.merge(merged_data, restaurants,on='restaurant_id',how='left',suffixes=('_order','_master'))

In [17]:
print("merged")
display(final_df.head())

merged

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_order,name,city,membership,restaurant_name_master,cuisine,rating
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Restaurant_293,Italian,3.0

In [19]:
final_df.to_csv("final_output.csv", index=False)